tap "getantibody/tap"
tap "homebrew/bundle"
tap "homebrew/core"
tap "jesseduffield/lazygit"
tap "linuxbrew/xorg"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# C/C++/ObjC language server
brew "ccls"
# Create and view interactive cheat sheets for *nix commands
brew "cheat"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Modern replacement for 'ls'
brew "exa"
# GNU debugger
brew "gdb"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Core application library for C
brew "glib"
# Validating, recursive, caching DNS resolver
brew "unbound"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# OpenResty's Branch of LuaJIT 2
brew "luajit-openresty"
# Small build system for use with gyp or CMake
brew "ninja"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Python version management
brew "pyenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Rust toolchain installer
brew "rustup-init"
# Cross-shell prompt for astronauts
brew "starship"
# Simplified and community-driven man pages
brew "tldr"
# HTTP benchmarking tool
brew "wrk"
# Friendly and fast tool for sending HTTP requests
brew "xh"
# A simple terminal UI for git commands, written in Go
brew "jesseduffield/lazygit/lazygit"
