tap "getantibody/tap"
tap "homebrew/bundle"
tap "homebrew/core"
tap "jesseduffield/lazygit"
tap "linuxbrew/xorg"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# C/C++/ObjC language server
brew "ccls"
# Create and view interactive cheat sheets for *nix commands
brew "cheat"
# Modern replacement for 'ls'
brew "exa"
# GNU debugger
brew "gdb"
# GitHub command-line tool
brew "gh"
# Validating, recursive, caching DNS resolver
brew "unbound"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Python version management
brew "pyenv"
# Migrate pip packages from one Python version to another
brew "pyenv-pip-migrate"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Emulator for x86 and PowerPC
brew "qemu"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Rust toolchain installer
brew "rustup-init"
# Simplified and community-driven man pages
brew "tldr"
# The fastest shell plugin manager
brew "getantibody/tap/antibody"
# A simple terminal UI for git commands, written in Go
brew "jesseduffield/lazygit/lazygit"
