tap "clojure/tools"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "mergestat/mergestat"
tap "proxmark/proxmark3"
tap "weihanglo/sfz", "https://github.com/weihanglo/sfz.git"
# Run your GitHub Actions locally
brew "act"
# Library and utilities for processing GIFs
brew "giflib"
# Library for manipulating PNG images
brew "libpng"
# General-purpose data compression with high compression ratio
brew "xz", link: false
# Core application library for C
brew "glib"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# New way to see and navigate directory trees
brew "broot"
# Powerful, enterprise-ready, open source web server with automatic HTTPS
brew "caddy"
# Manage compile and link flags for libraries
brew "pkg-config"
# Library for command-line editing
brew "readline"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Vector graphics library with cross-device output support
brew "cairo"
# Object-file caching compiler wrapper
brew "ccache"
# Create and view interactive cheat sheets for *nix commands
brew "cheat"
# Statistics utility to count lines of code
brew "cloc"
# Cross-platform make
brew "cmake"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Dependency manager for Cocoa projects
brew "cocoapods"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Power of curl, ease of use of httpie
brew "curlie"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Library for USB device access
brew "libusb"
# USB programmer
brew "dfu-util"
# Synchronize your DNS to multiple providers from a simple DSL
brew "dnscontrol"
# Command-line DNS client
brew "dog"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Modern replacement for 'ls'
brew "exa"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Simple and efficient way to access statistics in git
brew "git-quick-stats"
# Blazing fast terminal-ui for git written in rust
brew "gitui"
# Network related modules for glib
brew "glib-networking"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Go version management
brew "goenv", args: ["HEAD"]
# Image manipulation library
brew "jpeg", link: true
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Python 3 bindings for the Cairo graphics library
brew "py3cairo"
# GNOME Python bindings (based on GObject Introspection)
brew "pygobject3"
# Development framework for multimedia applications
brew "gstreamer"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Command-line pager for JSON data
brew "jless"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Library for USB device access
brew "libusb-compat"
# Powerful, lightweight programming language
brew "lua"
# Swiss Army Knife for macOS
brew "m-cli"
# Small build system for use with gyp or CMake
brew "ninja"
# Fast and user friendly build system
brew "meson"
# NCurses Disk Usage
brew "ncdu"
# Platform built on V8 to build network applications
brew "node"
# Classic snake game with textual interface
brew "nsnake"
# Ncurses based sudoku game
brew "nudoku"
# Optimized BLAS library
brew "openblas"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Emulator for x86 and PowerPC
brew "qemu"
# Cross-platform application and UI framework
brew "qt@5"
# Rust toolchain installer
brew "rustup-init"
# Software for mathematics, science, and engineering
brew "scipy"
# Display and control your Android device
brew "scrcpy"
# SOcket CAT: netcat on steroids
brew "socat"
# Simplified and community-driven man pages
brew "tldr"
# Internet file retriever
brew "wget"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# General-purpose lossless data-compression library
brew "zlib"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# The Clojure Programming Language
brew "clojure/tools/clojure"
# GCC for embedded ARM processors
brew "proxmark/proxmark3/arm-none-eabi-gcc"
# A simple static file serving command-line tool.
brew "weihanglo/sfz/sfz"
# JDK from the Java User Group (JUG)
cask "adoptopenjdk"
# Enable Windows-like alt-tab
cask "alt-tab"
# Android SDK component
cask "android-platform-tools"
# Inspect application bundles
cask "apparency"
# Lock/unlock Apple computers using the proximity of a bluetooth low energy device
cask "bleunlock"
# Free and open-source web browser
cask "chromium"
# Free monospaced font with programming ligatures
cask "font-fira-code"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
# Typeface made for developers
cask "font-jetbrains-mono"
# Open-source Chinese font derived from Fontworks' Klee One
cask "font-lxgw-wenkai"
cask "font-meslo-lg"
# Developer targeted fonts with a high number of glyphs
cask "font-meslo-lg-nerd-font"
# Utility to provide quick look previews for files that aren't natively supported
cask "glance-chamburr"
# Free and open-source media player
cask "iina"
# Hex editor for reverse engineers
cask "imhex"
# File archiver
cask "keka"
# Customize mouse behavior
cask "linearmouse"
# 2D game framework for Lua
cask "love"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Display image info and preview unsupported formats in QuickLook
cask "qlimagesize"
# QuickLook plugin for plaintext files without an extension
cask "qlstephen"
# Thumbnails, static previews, cover art and metadata for video files
cask "qlvideo"
# QuickLook generator for Adobe Swatch Exchange files
cask "quicklookase"
# Displays all open files and sockets in use by all running processes
cask "sloth"
# Graphical client for Git version control
cask "sourcetree"
# Application for inspecting installer packages
cask "suspicious-package"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin"
# Install and switch between multiple versions of Xcode
cask "xcodes"
vscode "aaron-bond.better-comments"
vscode "AhadCove.python-quick-print"
vscode "alefragnani.Bookmarks"
vscode "alefragnani.project-manager"
vscode "ant-codespaces.vscode-marketplace"
vscode "ant-codespaces.vscode-remote"
vscode "axetroy.vscode-npm-import-package-version"
vscode "bierner.lit-html"
vscode "ChakrounAnas.turbo-console-log"
vscode "codezombiech.gitignore"
vscode "dakara.transformer"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "DotJoshJohnson.xml"
vscode "dzgmelody.vscode-changelog-snippets"
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "emilast.LogFileHighlighter"
vscode "esbenp.prettier-vscode"
vscode "eseom.nunjucks-template"
vscode "fabiospampinato.vscode-open-in-github"
vscode "firsttris.vscode-jest-runner"
vscode "formulahendry.code-runner"
vscode "GitHub.copilot"
vscode "GitHub.remotehub"
vscode "github.vscode-github-actions"
vscode "GitHub.vscode-pull-request-github"
vscode "golang.go"
vscode "google.wireit"
vscode "Hyzeta.vscode-theme-github-light"
vscode "idered.npm"
vscode "jakob101.RelativePath"
vscode "jock.svg"
vscode "josetr.cmake-language-support-vscode"
vscode "LeetCode.vscode-leetcode"
vscode "mattlott.copy-github-url"
vscode "mikestead.dotenv"
vscode "mkxml.vscode-filesize"
vscode "ms-azuretools.vscode-docker"
vscode "MS-CEINTL.vscode-language-pack-zh-hans"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-playwright.playwright"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "mutantdino.resourcemonitor"
vscode "njpwerner.autodocstring"
vscode "npclaudiu.vscode-gn"
vscode "nrwl.angular-console"
vscode "oliversturm.fix-json"
vscode "ramyaraoa.show-offset"
vscode "rbuckton.tsserver-live-reload"
vscode "redhat.vscode-yaml"
vscode "refactor11.completeline"
vscode "richie5um2.vscode-sort-json"
vscode "ritwickdey.LiveServer"
vscode "rust-lang.rust-analyzer"
vscode "ryu1kn.text-marker"
vscode "samuelcolvin.jinjahtml"
vscode "sburg.vscode-javascript-booster"
vscode "semanticdiff.semanticdiff"
vscode "serayuzgur.crates"
vscode "shardulm94.trailing-spaces"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "stkb.rewrap"
vscode "streetsidesoftware.avro"
vscode "streetsidesoftware.code-spell-checker"
vscode "sullenor.vscode-transform-case"
vscode "sumneko.lua"
vscode "tamasfe.even-better-toml"
vscode "tombonnike.vscode-status-bar-format-toggle"
vscode "tomoki1207.pdf"
vscode "vinliao.fast-arrow"
vscode "vscode-icons-team.vscode-icons"
vscode "xabikos.JavaScriptSnippets"
vscode "yo1dog.cursor-align"
vscode "yoavbls.pretty-ts-errors"
vscode "zokugun.cron-tasks"
vscode "zokugun.sync-settings"
