tap "cantino/mcfly"
tap "clojure/tools"
tap "damenly/virt-manager"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "jeffreywildman/virt-manager"
tap "mergestat/mergestat"
tap "proxmark/proxmark3"
tap "weihanglo/sfz", "https://github.com/weihanglo/sfz.git"
# Run your GitHub Actions locally 🚀
brew "act"
# Library and utilities for processing GIFs
brew "giflib"
# Library for manipulating PNG images
brew "libpng"
# Core application library for C
brew "glib"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Manage compile and link flags for libraries
brew "pkg-config"
# New way to see and navigate directory trees
brew "broot"
# Powerful, enterprise-ready, open source web server with automatic HTTPS
brew "caddy"
# Library for command-line editing
brew "readline"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Vector graphics library with cross-device output support
brew "cairo"
# Object-file caching compiler wrapper
brew "ccache"
# Create and view interactive cheat sheets for *nix commands
brew "cheat"
# Statistics utility to count lines of code
brew "cloc"
# Cross-platform make
brew "cmake"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Dependency manager for Cocoa projects
brew "cocoapods"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Library for USB device access
brew "libusb"
# USB programmer
brew "dfu-util"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Modern replacement for 'ls'
brew "exa"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# OpenType text shaping engine
brew "harfbuzz"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Simple and efficient way to access statistics in git
brew "git-quick-stats"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Go version management
brew "goenv", args: ["HEAD"]
# Image manipulation library
brew "jpeg", link: true
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Command-line pager for JSON data
brew "jless"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Library for USB device access
brew "libusb-compat"
# Small build system for use with gyp or CMake
brew "ninja"
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Classic snake game with textual interface
brew "nsnake"
# Ncurses based sudoku game
brew "nudoku"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Python 3 bindings for the Cairo graphics library
brew "py3cairo"
# Python version management
brew "pyenv"
# Emulator for x86 and PowerPC
brew "qemu"
# Cross-platform application and UI framework
brew "qt@5"
# Rust toolchain installer
brew "rustup-init"
# Software for mathematics, science, and engineering
brew "scipy"
# SOcket CAT: netcat on steroids
brew "socat"
# Simplified and community-driven man pages
brew "tldr"
# Internet file retriever
brew "wget"
# McFly
brew "cantino/mcfly/mcfly"
# The Clojure Programming Language
brew "clojure/tools/clojure"
# App for virtualized guest interaction
brew "damenly/virt-manager/virt-viewer"
# GCC for embedded ARM processors
brew "proxmark/proxmark3/arm-none-eabi-gcc"
# A simple static file serving command-line tool.
brew "weihanglo/sfz/sfz"
# JDK from the Java User Group (JUG)
cask "adoptopenjdk"
# Apple TV Aerial screensaver
cask "aerial"
# Android SDK component
cask "android-platform-tools"
# Inspect application bundles
cask "apparency"
# Desktop password and login vault
cask "bitwarden"
# Lock/unlock Apple computers using the proximity of a bluetooth low energy device
cask "bleunlock"
# Free and open-source web browser
cask "chromium"
# Free monospaced font with programming ligatures
cask "font-fira-code"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
# Typeface made for developers
cask "font-jetbrains-mono"
cask "font-meslo-lg"
# Developer targeted fonts with a high number of glyphs
cask "font-meslo-lg-nerd-font"
# Free and open-source media player
cask "iina"
# File archiver
cask "keka"
# Extensible two-pane file manager
cask "marta"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Display image info and preview unsupported formats in QuickLook
cask "qlimagesize"
# QuickLook generator for Markdown files
cask "qlmarkdown"
# QuickLook plugin for plaintext files without an extension
cask "qlstephen"
# QuickLook generator for video files
cask "qlvideo"
# QuickLook generator for Adobe Swatch Exchange files
cask "quicklookase"
# Graphical client for Git version control
cask "sourcetree"
# Application for inspecting installer packages
cask "suspicious-package"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin"
